Feature: Тестирование резюме
  Тестовый задание cbr.ru

  Scenario: Переход в google
    When Открыли сайт "http://google.com"
    Then Появится поле поиск

  Scenario: Поиск сайта ЦБ РФ в Google
    When Ввели в поле поиска "Центральный банк РФ"
    And Нажали на кнопку поиск в google
    Then Появится ссылка на cbr.ru


  Scenario: Переход на сайт ЦБ РФ
    When Перешли на по первой из ссылок содержащих адресс "www.cbr.ru"
    Then Откроется сайт https://www.cbr.ru

  Scenario: Заполнение благодарности
    When Нажали на ссылку Интернет-приемная
    And Открыли раздел Написать благодарность
    And В поле Ваша благодарность ввели значение “случайный текст”
    And Поставили галочку “Я согласен”
    Then Сделать скриншот

  Scenario: Проверить предупреждение на английском
    When Нажали на кнопку меню ("Три полоски")
    And Нажали на раздел О сайте
    And Нажали на ссылку предупреждение
    And Запомнили текст предупреждения на русском
    And Сменили язык страницы на Английский
    Then Текст на английском должен отличаться от текста на русском
    And Сделать скриншот
